Tekla Open API Reference for Tekla Structures 2025
Localization.Util.LocalizeListControl Method
 Localizes a List control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void LocalizeListControl(
	Localization localization,
	Object obj
)
Public Shared Sub LocalizeListControl (
	localization As Localization,
	obj As Object
)
Parameters
localization
Type: Tekla.Structures.Dialog.Localization
The localization instance to be used.
obj
Type: System.Object
The object to be localized.
See Also
Reference
Localization.Util Class
Tekla.Structures.Dialog Namespace